<template>
  <div>
    <Card>
      <div class="marginB20">多页签页面传值</div>
      <div class="f_blod f_30 cRed">
        {{num}}
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
        <p>1315646230 邀请你加入 1315646230的团队</p>
      </div>
    </Card>
  </div>
</template>


<script>
export default {
  name:'test4',
  data() {
    let {
      $route:{
        query:{
          num
        }
      }
    }=this;
    let data = {
      num
    };
    return data;
  },
  watch:{
    '$route.query'(newObj,oldObj){
      this.num=newObj.num;
    }
  },
  created() {
    
  },

  methods: {
    
  },
  mounted() {
    //
  }
};
</script>

